#пользуясь сплитом вводим переменные в одну строку

b, q, n = map(int, input("Введите три значения(первый элемент, знаменатель, количество элементов): ").split())

#проверяем правильный ввод данных 

if (b>=-10000 and b<=10000 and q>=1 and q<=50 and n>=2 and n<=100):

   #находим сумму элементов геометрической прогрессии

   s = (b * (q**n - 1))/(q-1)
   
   #переводим из флоата в инт сумму

   s_int = int(s)

   print("Сумма геометрической прогрессии: ",s_int)

else :
   
   print("ОШИБКА(-10000<=b<=10000,1<=q<=50,2<=n<=100)")
