#ввод числа

n = int(input("Введите любое число: "))

#k - количество делителей числа n, далее про переменную k пояснение в цикле, ниже

k = 0

#проверяем каждое число(i) от 2 (включая) до проверяемого числа(n-1) (не включая) делит ли оно проверяемое число   
    
for i in range(2,n-1):
      
#если i делит n без остатка то это число(i) является делителем числа и число не простое, значит увеличиваем количество делителей на 1

   if(n%i==0):
         
       k+=1

#проверка правильного ввода

if (n>=1 and n<=100000):

 #проверка числа на то, является ли оно простым

 if(k>=1 or n == 1):
 
   print("n - не простое число")

   #вычисление количества операций до нуля

   rez = (n+2)//3

   print ("Количество операций до нуля: ", rez)

 else: 
 
   print("n - простое число")

else : 
   
   print("ОШИБКА(1<=n<=25)")
         