#ввод числа

n = int(input("Введите любое число: "))

#k - количество делителей числа n, пояснение про переменную k ниже, в цикле

k = 0
    
#проверяем каждое число(i) от 2 (включая) до проверяемого числа(n) (не включая) делит ли оно проверяемое число   
    
for i in range(2,n):

      #если i делит n без остатка то число не простое, значит i - делитель , тогда увеличиваем количество делителей на 1

      if(n%i==0):

         k+=1

#проверка правильного ввода

if (n>=1 and n<=25):

#проверка числа на то, является ли оно простым

 if (k>=1 or n == 1):
    
     print("n - не простое число")

 else:

    print("n - простое число")

else:

    print("ОШИБКА(1<=n<=25)")
